Revit 2024 API
WorksetId.IntegerValue Property
 Provides the value of the WorksetId as an integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int IntegerValue { get; }
Visual Basic
Public ReadOnly Property IntegerValue As Integer
	Get
Visual C++
public:
property int IntegerValue {
	int get ();
}
See Also
WorksetId Class
Autodesk.Revit.DB Namespace